LogFiles/HtmlPerfectClientWrk2V1.txt
Running 1m test @ http://169.254.90.222:8181/jsonShortPerfect
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.537ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.531ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms    1.88ms  56.58ms   99.13%
    Req/Sec     3.36k   339.03     7.11k    69.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.47ms
 75.000%    2.04ms
 90.000%    2.56ms
 99.000%    3.43ms
 99.900%   36.51ms
 99.990%   53.47ms
 99.999%   55.52ms
100.000%   56.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.194     0.000000            1         1.00
       0.665     0.100000        32025         1.11
       0.861     0.200000        63831         1.25
       1.060     0.300000        95751         1.43
       1.264     0.400000       127515         1.67
       1.471     0.500000       159460         2.00
       1.577     0.550000       175399         2.22
       1.685     0.600000       191327         2.50
       1.796     0.650000       207248         2.86
       1.912     0.700000       223177         3.33
       2.036     0.750000       239108         4.00
       2.105     0.775000       247196         4.44
       2.179     0.800000       255143         5.00
       2.261     0.825000       263063         5.71
       2.349     0.850000       271021         6.67
       2.449     0.875000       278943         8.00
       2.505     0.887500       282954         8.89
       2.563     0.900000       286882        10.00
       2.629     0.912500       290948        11.43
       2.697     0.925000       294932        13.33
       2.771     0.937500       298900        16.00
       2.811     0.943750       300850        17.78
       2.853     0.950000       302845        20.00
       2.899     0.956250       304822        22.86
       2.953     0.962500       306848        26.67
       3.011     0.968750       308811        32.00
       3.045     0.971875       309808        35.56
       3.081     0.975000       310773        40.00
       3.125     0.978125       311797        45.71
       3.179     0.981250       312807        53.33
       3.243     0.984375       313788        64.00
       3.279     0.985938       314282        71.11
       3.323     0.987500       314763        80.00
       3.385     0.989062       315270        91.43
       3.467     0.990625       315753       106.67
       3.621     0.992188       316251       128.00
       3.791     0.992969       316500       142.22
       4.183     0.993750       316749       160.00
       4.999     0.994531       316998       182.86
       6.315     0.995313       317246       213.33
       8.607     0.996094       317495       256.00
      10.799     0.996484       317619       284.44
      12.623     0.996875       317743       320.00
      14.519     0.997266       317868       365.71
      16.479     0.997656       317992       426.67
      20.239     0.998047       318117       512.00
      22.255     0.998242       318179       568.89
      26.319     0.998437       318241       640.00
      29.903     0.998633       318304       731.43
      33.215     0.998828       318366       853.33
      36.991     0.999023       318429      1024.00
      39.103     0.999121       318460      1137.78
      40.575     0.999219       318490      1280.00
      42.623     0.999316       318522      1462.86
      44.287     0.999414       318553      1706.67
      45.823     0.999512       318584      2048.00
      46.623     0.999561       318600      2275.56
      47.487     0.999609       318615      2560.00
      48.735     0.999658       318631      2925.71
      49.823     0.999707       318646      3413.33
      51.007     0.999756       318662      4096.00
      51.551     0.999780       318669      4551.11
      51.903     0.999805       318677      5120.00
      52.511     0.999829       318685      5851.43
      52.895     0.999854       318693      6826.67
      53.247     0.999878       318702      8192.00
      53.439     0.999890       318705      9102.22
      53.503     0.999902       318708     10240.00
      53.919     0.999915       318714     11702.86
      54.079     0.999927       318716     13653.33
      54.271     0.999939       318720     16384.00
      54.399     0.999945       318722     18204.44
      54.495     0.999951       318724     20480.00
      54.655     0.999957       318726     23405.71
      54.719     0.999963       318728     27306.67
      55.039     0.999969       318730     32768.00
      55.071     0.999973       318731     36408.89
      55.103     0.999976       318733     40960.00
      55.103     0.999979       318733     46811.43
      55.327     0.999982       318734     54613.33
      55.487     0.999985       318735     65536.00
      55.487     0.999986       318735     72817.78
      55.519     0.999988       318736     81920.00
      55.519     0.999989       318736     93622.86
      55.583     0.999991       318737    109226.67
      55.583     0.999992       318737    131072.00
      55.583     0.999993       318737    145635.56
      56.255     0.999994       318738    163840.00
      56.255     0.999995       318738    187245.71
      56.255     0.999995       318738    218453.33
      56.255     0.999996       318738    262144.00
      56.255     0.999997       318738    291271.11
      56.607     0.999997       318739    327680.00
      56.607     1.000000       318739          inf
#[Mean    =        1.639, StdDeviation   =        1.876]
#[Max     =       56.576, Total count    =       318739]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  382611 requests in 1.00m, 40.50MB read
  Non-2xx or 3xx responses: 382611
Requests/sec:   6376.78
Transfer/sec:    691.23KB