LogFiles/JsonPerfectClientWrk2V1.txt
Running 1m test @ http://169.254.90.222:8081/jsonPerfect
  2 threads and 10 connections
  Thread calibration: mean lat.: 6.005ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.994ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.68ms    1.49ms  18.83ms   72.17%
    Req/Sec   160.22     64.77   312.00     62.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.26ms
 75.000%    6.49ms
 90.000%    7.83ms
 99.000%   10.18ms
 99.900%   12.59ms
 99.990%   17.89ms
 99.999%   18.85ms
100.000%   18.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.251     0.000000            1         1.00
       4.127     0.100000         1726         1.11
       4.487     0.200000         3454         1.25
       4.763     0.300000         5145         1.43
       5.019     0.400000         6888         1.67
       5.263     0.500000         8581         2.00
       5.403     0.550000         9452         2.22
       5.579     0.600000        10294         2.50
       5.803     0.650000        11153         2.86
       6.119     0.700000        12016         3.33
       6.495     0.750000        12869         4.00
       6.667     0.775000        13300         4.44
       6.859     0.800000        13726         5.00
       7.071     0.825000        14155         5.71
       7.275     0.850000        14580         6.67
       7.507     0.875000        15007         8.00
       7.663     0.887500        15225         8.89
       7.827     0.900000        15439        10.00
       7.995     0.912500        15655        11.43
       8.191     0.925000        15868        13.33
       8.375     0.937500        16082        16.00
       8.503     0.943750        16196        17.78
       8.655     0.950000        16295        20.00
       8.807     0.956250        16409        22.86
       8.943     0.962500        16508        26.67
       9.143     0.968750        16617        32.00
       9.263     0.971875        16669        35.56
       9.407     0.975000        16727        40.00
       9.535     0.978125        16775        45.71
       9.679     0.981250        16831        53.33
       9.839     0.984375        16885        64.00
       9.911     0.985938        16911        71.11
       9.991     0.987500        16936        80.00
      10.087     0.989062        16966        91.43
      10.223     0.990625        16990       106.67
      10.343     0.992188        17017       128.00
      10.431     0.992969        17031       142.22
      10.591     0.993750        17043       160.00
      10.711     0.994531        17057       182.86
      10.879     0.995313        17070       213.33
      11.079     0.996094        17084       256.00
      11.135     0.996484        17091       284.44
      11.231     0.996875        17097       320.00
      11.375     0.997266        17104       365.71
      11.479     0.997656        17110       426.67
      11.631     0.998047        17117       512.00
      11.663     0.998242        17120       568.89
      11.807     0.998437        17124       640.00
      11.911     0.998633        17127       731.43
      12.055     0.998828        17130       853.33
      12.671     0.999023        17134      1024.00
      12.839     0.999121        17135      1137.78
      12.999     0.999219        17137      1280.00
      13.159     0.999316        17140      1462.86
      13.159     0.999414        17140      1706.67
      13.287     0.999512        17142      2048.00
      13.375     0.999561        17143      2275.56
      13.399     0.999609        17144      2560.00
      13.703     0.999658        17145      2925.71
      13.703     0.999707        17145      3413.33
      13.951     0.999756        17146      4096.00
      14.095     0.999780        17147      4551.11
      14.095     0.999805        17147      5120.00
      17.887     0.999829        17148      5851.43
      17.887     0.999854        17148      6826.67
      17.887     0.999878        17148      8192.00
      18.559     0.999890        17149      9102.22
      18.559     0.999902        17149     10240.00
      18.559     0.999915        17149     11702.86
      18.559     0.999927        17149     13653.33
      18.559     0.999939        17149     16384.00
      18.847     0.999945        17150     18204.44
      18.847     1.000000        17150          inf
#[Mean    =        5.676, StdDeviation   =        1.494]
#[Max     =       18.832, Total count    =        17150]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20282 requests in 1.08m, 135.49MB read
Requests/sec:    311.99
Transfer/sec:      2.08MB